{
  "tech": [
    "¿Por qué la computadora fue al médico? Porque tenía un virus.",
    "¿Qué le dijo un servidor a otro? Estoy caído por ti.",
    "¿Cuál es el café más peligroso del mundo? El ex-preso.",
    "El teclado se deprimió porque tenía demasiadas teclas rotas.",
    "Los programadores no mueren, solo se convierten en código legacy.",
    "Un bit le dice a otro: nos vemos en el bus.",
    "¿Por qué los programadores confunden Halloween y Navidad? Porque OCT 31 = DEC 25.",
    "El WiFi y yo tenemos una relación seria: sin conexión me siento vacío.",
    "El software es como el amor: gratis si sabes dónde buscar.",
    "¿Cuál es el animal favorito de un programador? El bug.",
    "Un byte entra a un bar y pide una cerveza. El bartender dice: '¿Quieres que lo alinee a la izquierda o a la derecha?'.",
    "Si no puedes con el bug... hazlo feature.",
    "Los piratas modernos ya no buscan oro, buscan WiFi gratis.",
    "¿Por qué el celular estaba triste? Porque tenía poca señal de apoyo.",
    "Si la vida te da errores, conviértelos en excepciones.",
    "¿Por qué el servidor rompió con la base de datos? Porque encontró a alguien con mejores queries.",
    "Un programador pobre siempre está sin cash… solo con cache.",
    "¿Qué le dijo el 0 al 1? ‘Eres único en tu especie’.",
    "Los programadores comen mientras trabajan… hacen snack(overflow).",
    "¿Qué dijo el disco duro al apagarse? 'Al fin puedo descansar en paz'.",
    "Un informático fue al doctor y le dijo: 'Doctor, me duele aquí'. El doctor responde: 'Eso no es un bug, es una feature'.",
    "El firewall no dejó entrar a nadie a la fiesta.",
    "Un algoritmo entra a un bar y le pregunta al bartender: '¿Qué hay de nuevo?'.",
    "¿Qué hace un programador cuando tiene frío? Cierra las ventanas.",
    "La nube no estaba disponible, porque estaba lloviendo.",
    "Un hacker robó mi WiFi y aún así la conexión mejoró.",
    "¿Por qué los programadores siempre llevan anteojos? Porque no ven un C sin ++.",
    "El compilador siempre tiene la última palabra.",
    "La impresora está de huelga: dice que ya no soporta más papel.",
    "El error 404 intentó ir a la fiesta, pero no fue encontrado.",
    "Si un bug te persigue, respóndele con un try/catch.",
    "El programador no se pierde, solo hace un loop infinito.",
    "Un servidor siempre está cansado porque trabaja 24/7.",
    "La memoria RAM se olvidó de invitar a sus amigos.",
    "El programador no duerme, solo entra en modo suspendido.",
    "¿Por qué la PC no salió de casa? Porque tenía ventanas abiertas.",
    "Un proxy entró al cine… pero nadie lo reconoció.",
    "¿Qué dijo Java al romper con C++? 'No eres mi tipo'.",
    "Los discos duros son muy dramáticos: siempre fragmentados.",
    "El código estaba celoso porque no lo compilaban.",
    "Un script mal escrito entró a un bar y todos lo ignoraron… tenía mala sintaxis.",
    "Los errores ortográficos también son bugs, pero en humanos.",
    "Si no sabes qué hacer, presiona Ctrl+Z.",
    "La vida sin internet sería como un navegador sin pestañas.",
    "El mouse se divorció porque el teclado no dejaba de tocar.",
    "El antivirus fue a terapia: estaba cansado de ser tan negativo.",
    "El hacker entró a la panadería y pidió cookies.",
    "El DNS se perdió buscando la dirección de su casa.",
    "Un dev dijo: 'Si funciona, no lo toques'.",
    "El hosting es como la amistad: mejor cuando es estable."
  ],
  "random": [
    "¿Qué hace una abeja en el gimnasio? Zum-ba.",
    "¿Qué le dijo un semáforo a otro? No me mires que me estoy cambiando.",
    "Si el río suena... es porque Spotify no paga.",
    "Un pez le dice a otro: ¿qué hace tu papá? Nada.",
    "¿Cuál es el animal más antiguo? La cebra, porque está en blanco y negro.",
    "El colmo de un electricista es que no lo sigan los focos.",
    "¿Qué hace un perro con un taladro? Taladrando.",
    "Un jardinero feliz se va por las ramas.",
    "¿Qué hace una taza en la escuela? Taza-mates.",
    "El libro de matemáticas estaba triste porque tenía muchos problemas.",
    "Si la montaña no viene a ti, es porque fuiste a la dirección equivocada.",
    "El colmo de un sastre: que se le vaya el hilo.",
    "Un plátano le dice a otro: estoy pelado.",
    "El café más peligroso: el ex-preso.",
    "Un pajarito va al hospital… porque estaba mal de la garganta.",
    "¿Cuál es el animal más fiestero? El pingüino, porque siempre anda en smoking.",
    "¿Qué hace un pez mago? Nada por arte de magia.",
    "El sol nunca va a la escuela porque ya tiene un grado.",
    "Un colmo de un carnicero: que le dé miedo la sangre.",
    "El caballo entró al bar y el bartender dijo: '¿Por qué la cara larga?'.",
    "El queso se deprimió porque lo dejaron solo.",
    "Un tomate en la carretera dijo: '¡Estoy aplastado!'.",
    "Un hombre invisible se casó… nadie lo vio.",
    "El lápiz está feliz porque tiene buena punta.",
    "Un huevo fue al cine… y lo frieron con palomitas.",
    "El perro del mago se llamaba Dogo-dini.",
    "Un pez estudioso siempre anda en la escuela.",
    "Un árbol nunca se pelea porque siempre da la rama.",
    "El pingüino le dijo al oso: no seas frío.",
    "El reloj se cansó… estaba dando vueltas todo el día.",
    "Un zapato le dijo al otro: no me pises.",
    "El viento nunca se pierde, siempre anda de corriente.",
    "Un ratón feliz vive en la nube.",
    "El gato aprendió a programar porque tenía 9 vidas.",
    "El burro fue al médico porque estaba de mala oreja.",
    "Una lámpara se apagó porque no brillaba más.",
    "Un cuaderno lloró porque le arrancaron la hoja.",
    "El tren se fue triste porque lo dejaron en vía muerta.",
    "El perro pidió pizza con hueso extra.",
    "El conejo nunca se pierde porque tiene mucha oreja.",
    "Una abeja canta reggaetón: ¡Zum-zum-bay!.",
    "El loro se enojó porque lo repitieron mucho.",
    "Un pez fue a la biblioteca y pidió un libro de agua.",
    "La escoba estaba cansada de barrer siempre lo mismo.",
    "Un perro estudió tanto que sacó puro 10.",
    "El burro se metió a la universidad, pero reprobó orejas.",
    "Una vaca en el espacio: vaca-nauta.",
    "El teléfono se deprimió porque nadie lo llamaba.",
    "Un ratón hizo dieta y bajó de peso en megabytes.",
    "El árbol dijo: déjame en paz, soy raíz."
  ],
  "dark": [
    "El cementerio está lleno… pero siempre hay espacio para uno más.",
    "Dicen que el dinero no da la felicidad… pero prefiero llorar en un Ferrari.",
    "Mi terapeuta me dijo que piense en positivo… así que ahora espero lo peor con entusiasmo.",
    "¿Qué hace un zombie con un GPS? Busca la dirección del cerebro.",
    "Si la vida es dura… imagina el ataúd.",
    "Mi sombra me abandona de noche… hasta ella me da la espalda.",
    "El colmo de un muerto: que no lo entierren con cobertura.",
    "Dicen que el trabajo duro nunca mató a nadie… pero prefiero no arriesgarme.",
    "Una lápida dijo: 'aquí descansa alguien que quería descansar más'.",
    "Un vampiro fue al médico… porque tenía anemia.",
    "La parca nunca descansa: siempre está en guardia.",
    "Mi vida social está tan muerta como mi cactus.",
    "El ataúd está de moda… todos quieren caer ahí.",
    "Un esqueleto fue a la fiesta… pero no tenía cuerpo para acompañarlo.",
    "El fantasma nunca paga renta: vive de gorra.",
    "Mi familia me dijo que me relajara… así que me hice muerto.",
    "El cementerio es el barrio más tranquilo.",
    "Un zombi fue al gimnasio: quería ponerse más ‘muerto en vida’.",
    "Dicen que el miedo no mata… pero el susto sí.",
    "Un asesino serial fue a la panadería: pidió pan rebanado.",
    "La oscuridad me sigue… y a veces la adelanto.",
    "Un muerto siempre está en tendencia: nunca pasa de moda.",
    "Mi celular tiene más vida que yo.",
    "El reloj de un muerto siempre está parado.",
    "Un fantasma entró al banco… y nadie lo notó.",
    "Dicen que no se puede vivir del aire… pero yo me estoy muriendo igual.",
    "El vampiro dejó a su novia porque era muy tóxica.",
    "El cementerio tiene la mejor seguridad… nadie sale.",
    "El alma en pena pidió vacaciones.",
    "Un funeral es la única fiesta donde el invitado de honor no dice nada.",
    "El muerto más puntual… siempre llega al entierro.",
    "Mi vecino es tan aburrido que ni la parca lo visita.",
    "La lápida decía: 'Por fin silencio'.",
    "Un cuervo le dijo a otro: ‘te veo en la oscuridad’.",
    "Dicen que el amor es eterno… hasta que te entierran con tu ex.",
    "El esqueleto fue al cine, pero no tenía nervios de acero.",
    "Un fantasma fue al gimnasio, pero no levantaba nada: era puro espíritu.",
    "La calavera no sonrió… porque no tenía piel.",
    "Un zombi pidió cerebros en Uber Eats.",
    "El diablo abrió un spa: 'relajación eterna garantizada'.",
    "Mi motivación murió antes que yo.",
    "Un muerto nunca se queja del calor ni del frío.",
    "El ataúd es el mejor colchón: descanso eterno.",
    "El verdugo tiene trabajo seguro.",
    "El miedo a la oscuridad es el más irónico de todos… siempre está contigo.",
    "Un esqueleto aplicó a modelaje: siempre está en los huesos.",
    "El muerto no estudia… pero descansa en paz.",
    "El reloj de arena del cementerio nunca se da vuelta.",
    "Un cadáver dijo: 'me muero por estar aquí'."
  ]
}
